# chaper#7

# Data Cleaning and Preparation

In [64]:
import pandas as pd
import numpy as np

In [84]:
data=[
{'Name': 'Inam', 'Age': 42, 'Course': 'AI'}, 
{'Name': 'Daniyal', 'Age': 26, 'location': 'SAIM', 'Course': 'CNCF', 'Timing': np.NaN},
{}]

In [99]:
df = pd.DataFrame(data)

In [88]:
df.head()

    Age Course     Name  Timing location
0  42.0     AI     Inam     NaN      NaN
1  26.0   CNCF  Daniyal     NaN     SAIM
2   NaN    NaN      NaN     NaN      NaN

In [8]:
df

   Age Course     Name location
0   42     AI     Inam     SBSA
1   26   CNCF  Daniyal     SAIM

In [19]:
df.Course == "AI"

0     True
1    False
Name: Course, dtype: bool

In [34]:
df

   Age Course     Name  Timing location
0   42     AI     Inam     NaN     SBSA
1   26   CNCF  Daniyal  5 to 9     SAIM

In [24]:
df[(df.Course == 'AI') & (df.location == 'SBSA')]

   Age Course  Name location
0   42     AI  Inam     SBSA

In [26]:
df[(df.Course == 'CNCF') | (df.Name == 'Inam')]

   Age Course     Name location
0   42     AI     Inam     SBSA
1   26   CNCF  Daniyal     SAIM

In [32]:
print(df.isnull())
print(df.notnull())

     Age  Course   Name  Timing  location
0  False   False  False    True     False
1  False   False  False   False     False
    Age  Course  Name  Timing  location
0  True    True  True   False      True
1  True    True  True    True      True

In [114]:
df

    Age Course     Name  Timing location
0  42.0     AI     Inam     NaN      NaN
1  26.0   CNCF  Daniyal     NaN     SAIM
2   NaN    NaN      NaN     NaN      NaN

In [89]:
complete_data = df.dropna(thresh=4)

In [90]:
complete_data

    Age Course     Name  Timing location
1  26.0   CNCF  Daniyal     NaN     SAIM

In [119]:
filled_df = df.fillna(method='bfill')
#filled_df.loc[-2:] = filled_df.loc[-2:].fillna(method='ffill')
new_ds = filled_df.fillna(method='ffill', inplace=True)
print(filled_df)
print(new_ds)
# print(filled_df)

    Age Course     Name  Timing location
0  42.0     AI     Inam     NaN     SAIM
1  26.0   CNCF  Daniyal     NaN     SAIM
2  26.0   CNCF  Daniyal     NaN     SAIM
None

In [120]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [125]:
# data.duplicated()
unique_records = data.drop_duplicates(keep='last')
print(unique_records)
print(data)

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4
    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [158]:
data = pd.DataFrame({'food': ['NA', 'pulled pork', 'bacon', '-', '.', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}
lowercased = data['food'].str.upper()
print(lowercased)
print(data['food'].shape)
to_upper_map_cersion = data['food'].map(to_upper)

0             NA
1    PULLED PORK
2          BACON
3              -
4              .
5          BACON
6       PASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object
(9,)

In [143]:
to_upper_map_cersion

0          My-Upper: BACON
1    My-Upper: PULLED PORK
2          My-Upper: BACON
3       My-Upper: PASTRAMI
4    My-Upper: CORNED BEEF
5          My-Upper: BACON
6       My-Upper: PASTRAMI
7      My-Upper: HONEY HAM
8       My-Upper: NOVA LOX
Name: food, dtype: object

In [141]:
def to_lower(value):
    return value.lower()
def to_upper(value):
    return 'My-Upper: ' + value.upper()

In [145]:
data

          food  ounces
0           NA     4.0
1  pulled pork     3.0
2        bacon    12.0
3            -     6.0
4            .     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [148]:
data_replaced = data.replace(['.', '-', 'NA'], np.nan)
data_replaced

          food  ounces
0          NaN     4.0
1  pulled pork     3.0
2        bacon    12.0
3          NaN     6.0
4          NaN     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [159]:
data.index

RangeIndex(start=0, stop=9, step=1)

In [162]:
data.index = data.index.map(lambda x: x + 2)
data

           food  ounces
6            NA     4.0
7   pulled pork     3.0
8         bacon    12.0
9             -     6.0
10            .     7.5
11        Bacon     8.0
12     pastrami     3.0
13    honey ham     5.0
14     nova lox     6.0

In [ ]:
while True :
    
    print("Press 1 for Farenheit  to Celcius or c or C\nPress 2 for Celcius to Farenheit or F or f\nPress 3 for Kelvin to Farenheit or k or K\nPress 4 for know temp in all scale\nPress q or Q for Exit")
   # Temp = str(input("Please enter temp or For quit press q =  "))
    choice = ("Celcius, Farenheit, Kelvin")
    Temp = float(input("Please enter temp =  "))
    choice = input ("\nEnter once time to Know Temp or Press q For Exit ?")
    if choice == "q" or choice == "Q" or choice == "Quit" or choice == "quit":         
        break
        x = input("Please select the scale :")
    if scale == "1" or scale == "c" or scale == "C" :
        print(f"Temp in Celcius ={float(Temp-32)*0.5555555555555556}")
    elif  scale == "2" or scale == "f" or scale == "F" :
        print(f"Temp in Farenheit ={(float(Temp*1.8+32))}")
    elif  scale == "3" or scale == "K" or scale == "k" :
        print(f"Temp in Kelvin ={(float(Temp-32)*0.5555555555555556+273.15)}")
    elif  scale == "4"  :
        print(f"Temp in Celcius ={(float(Temp-32)*0.5555555555555556)}")
        print(f"Temp in Farenheit ={(float(Temp*1.8+32))}")
        print(f"Temp in Kelvin ={(float((Temp-32)*0.5555555555555556+273.15))}")
 #   elif scale!= "4" or scale != "3" or scale != "K" or scale != "k" or scale != "2" or scale != "f" or scale != "F" or scale != "1" or scale != "c" or scale != "C" :
  #      print("you made wrong Entry")

Press 1 for Farenheit  to Celcius or c or C
Press 2 for Celcius to Farenheit or F or f
Press 3 for Kelvin to Farenheit or k or K
Press 4 for know temp in all scale
Press q or Q for Exit